Revit 2027 API
DividedPath.FixedNumberOfPoints Property
 The number of points used when the layout is set to 'FixedNumber'.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int FixedNumberOfPoints { get; set; }
Public Property FixedNumberOfPoints As Integer
	Get
	Set
public:
property int FixedNumberOfPoints {
	int get ();
	void set (int value);
}
member FixedNumberOfPoints : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentException |  When setting this property: fixedNumberOfPoints must be at least 2 and at most 200.
Remarks
 To get the actual number of point use GetNumberOfPoints().
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace